#ifndef MEMORY_H
# define MEMORY_H

# include "types.h"
# include "cartridge.h"

# define JOYP	0xFF00 // Joypad	Mixed
# define SB		0xFF01 // Serial transfer data	R/W
# define SC		0xFF02 // Serial transfer control	R/W
# define DIV	0xFF04 // Divider register	R/W
# define TIMA	0xFF05 // Timer counter	R/W
# define TMA	0xFF06 // Timer modulo	R/W
# define TAC	0xFF07 // Timer control	R/W
# define IF		0xFF0F // Interrupt flag	R/W
# define NR10	0xFF10 // Sound channel 1 sweep	R/W
# define NR11	0xFF11 // Sound channel 1 length timer & duty cycle	Mixed
# define NR12	0xFF12 // Sound channel 1 volume & envelope	R/W
# define NR13	0xFF13 // Sound channel 1 period low	W
# define NR14	0xFF14 // Sound channel 1 period high & control	Mixed
# define NR21	0xFF16 // Sound channel 2 length timer & duty cycle	Mixed
# define NR22	0xFF17 // Sound channel 2 volume & envelope	R/W
# define NR23	0xFF18 // Sound channel 2 period low	W
# define NR24	0xFF19 // Sound channel 2 period high & control	Mixed
# define NR30	0xFF1A // Sound channel 3 DAC enable	R/W
# define NR31	0xFF1B // Sound channel 3 length timer	W
# define NR32	0xFF1C // Sound channel 3 output level	R/W
# define NR33	0xFF1D // Sound channel 3 period low	W
# define NR34	0xFF1E // Sound channel 3 period high & control	Mixed
# define NR41	0xFF20 // Sound channel 4 length timer	W
# define NR42	0xFF21 // Sound channel 4 volume & envelope	R/W
# define NR43	0xFF22 // Sound channel 4 frequency & randomness	R/W
# define NR44	0xFF23 // Sound channel 4 control	Mixed
# define NR50	0xFF24 // Master volume & VIN panning	R/W
# define NR51	0xFF25 // Sound panning	R/W
# define NR52	0xFF26 // Sound on/off	Mixed
# define FF3F	0xFF30 // Wave RAM	Storage for one of the sound channels’ waveform	R/W
# define LCDC	0xFF40 // LCD control	R/W
# define STAT	0xFF41 // LCD status	Mixed
# define SCY	0xFF42 // Viewport Y position	R/W
# define SCX	0xFF43 // Viewport X position	R/W
# define LY		0xFF44 // LCD Y coordinate	R
# define LYC	0xFF45 // LY compare	R/W
# define DMA	0xFF46 // OAM DMA source address & start	R/W
# define BGP	0xFF47 // BG palette data	R/W
# define OBP0	0xFF48 // OBJ palette 0 data	R/W
# define OBP1	0xFF49 // OBJ palette 1 data	R/W
# define WY		0xFF4A // Window Y position	R/W
# define WX		0xFF4B // Window X position plus 7	R/W
# define BANK	0xFF50 // Boot ROM mapping control	W
# define IE		0xFFFF // Interrupt enable	R/W

typedef struct {
	u8 rom_bank0[0x4000];		// 0000 - 3FFF
	u8 rom_bank1[0x4000];		// 4000 - 7FFF
	u8 video_ram[0x2000];		// 8000 - 9FFF
	u8 external_ram[0x2000];	// A000 - BFFF
	u8 work_ram[0x2000];		// C000 - DFFF
	u8 echo_ram[0x1E00];		// E000 - FDFF
	u8 oam[0xA0];				// FE00 - FE9F
	u8 unused[0x60];			// FEA0 - FEFF
	u8 io_registers[0x7F];		// FF00 - FF7F
	u8 high_ram[0x7F];			// FF80 - FFFE
	u8 ie_register[0x1];		// FFFF
} memory_t;

extern memory_t memory;

void write8(u16 address, u8 val);

void write16(u16 address, u16 val);

u8 read8(u16 address);

u16 read16(u16 address);

u8 get_flag(u8 byte, u8 bit);

void set_flag(u8* byte, u8 bit, u8 val);

static u8 boot_rom[0x100] = {
	0x31, 0xFE, 0xFF, 0xAF, 0x21, 0xFF, 0x9F, 0x32, 0xCB, 0x7C, 0x20, 0xFB, 0x21, 0x26, 0xFF, 0x0E,
	0x11, 0x3E, 0x80, 0x32, 0xE2, 0x0C, 0x3E, 0xF3, 0xE2, 0x32, 0x3E, 0x77, 0x77, 0x3E, 0xFC, 0xE0,
	0x47, 0x11, 0x04, 0x01, 0x21, 0x10, 0x80, 0x1A, 0xCD, 0x95, 0x00, 0xCD, 0x96, 0x00, 0x13, 0x7B,
	0xFE, 0x34, 0x20, 0xF3, 0x11, 0xD8, 0x00, 0x06, 0x08, 0x1A, 0x13, 0x22, 0x23, 0x05, 0x20, 0xF9,
	0x3E, 0x19, 0xEA, 0x10, 0x99, 0x21, 0x2F, 0x99, 0x0E, 0x0C, 0x3D, 0x28, 0x08, 0x32, 0x0D, 0x20,
	0xF9, 0x2E, 0x0F, 0x18, 0xF3, 0x67, 0x3E, 0x64, 0x57, 0xE0, 0x42, 0x3E, 0x91, 0xE0, 0x40, 0x04,
	0x1E, 0x02, 0x0E, 0x0C, 0xF0, 0x44, 0xFE, 0x90, 0x20, 0xFA, 0x0D, 0x20, 0xF7, 0x1D, 0x20, 0xF2,
	0x0E, 0x13, 0x24, 0x7C, 0x1E, 0x83, 0xFE, 0x62, 0x28, 0x06, 0x1E, 0xC1, 0xFE, 0x64, 0x20, 0x06,
	0x7B, 0xE2, 0x0C, 0x3E, 0x87, 0xE2, 0xF0, 0x42, 0x90, 0xE0, 0x42, 0x15, 0x20, 0xD2, 0x05, 0x20,
	0x4F, 0x16, 0x20, 0x18, 0xCB, 0x4F, 0x06, 0x04, 0xC5, 0xCB, 0x11, 0x17, 0xC1, 0xCB, 0x11, 0x17,
	0x05, 0x20, 0xF5, 0x22, 0x23, 0x22, 0x23, 0xC9, 0xCE, 0xED, 0x66, 0x66, 0xCC, 0x0D, 0x00, 0x0B,
	0x03, 0x73, 0x00, 0x83, 0x00, 0x0C, 0x00, 0x0D, 0x00, 0x08, 0x11, 0x1F, 0x88, 0x89, 0x00, 0x0E,
	0xDC, 0xCC, 0x6E, 0xE6, 0xDD, 0xDD, 0xD9, 0x99, 0xBB, 0xBB, 0x67, 0x63, 0x6E, 0x0E, 0xEC, 0xCC,
	0xDD, 0xDC, 0x99, 0x9F, 0xBB, 0xB9, 0x33, 0x3E, 0x3C, 0x42, 0xB9, 0xA5, 0xB9, 0xA5, 0x42, 0x3C,
	0x21, 0x04, 0x01, 0x11, 0xA8, 0x00, 0x1A, 0x13, 0xBE, 0x20, 0xFE, 0x23, 0x7D, 0xFE, 0x34, 0x20,
	0xF5, 0x06, 0x19, 0x78, 0x86, 0x23, 0x05, 0x20, 0xFB, 0x86, 0x20, 0xFE, 0x3E, 0x01, 0xE0, 0x50
};

int init_memory();

#endif
